
print('Введите название животного которое вы бы хотели завести себе домой ')

a=input('название животного ')
if a== 'кот':
	print('\
	\nПреимущества кошки в доме\
	\n Она избавит от одиночества, будет ластиться и мурлыкать, окружая добротой и лаской;\
	\n Свободное время можно посвятить ей, ухаживая и играясь с различными предметами;\
	\n Она отличный охотник на мышей и крыс, которые будут досаждать и портить продукты в доме;\
	\n Дети смогут играться с кошкой, веселиться, наблюдая за ней, при этом их можно приучить к ответственности по уходу за питомцем;\
	\n Кошка отличный терапевт, поэтому если что-то болит или возникает стрессовое состояние, она это почувствует, и вмиг будет сидеть на руках.\
	\n Кому нельзя иметь кошу\
	\n Семьям с детьми до 4-5 лет.\
	\n Людям, страдающим аллергией.Людям, без свободного времени.\
	\n Людям, без постоянного места жительства и материального обеспечения.')
if a== 'Кот':
	print('\
	\nПреимущества кошки в доме\
	\n Она избавит от одиночества, будет ластиться и мурлыкать, окружая добротой и лаской;\
	\n Свободное время можно посвятить ей, ухаживая и играясь с различными предметами;\
	\n Она отличный охотник на мышей и крыс, которые будут досаждать и портить продукты в доме;\
	\n Дети смогут играться с кошкой, веселиться, наблюдая за ней, при этом их можно приучить к ответственности по уходу за питомцем;\
	\n Кошка отличный терапевт, поэтому если что-то болит или возникает стрессовое состояние, она это почувствует, и вмиг будет сидеть на руках.\
	\n Кому нельзя иметь кошу\
	\n Семьям с детьми до 4-5 лет.\
	\n Людям, страдающим аллергией.Людям, без свободного времени.\
	\n Людям, без постоянного места жительства и материального обеспечения.')
elif a == 'собака':
	print('\
	\nБoльшинcтвo людeй yвepeны, чтo ocнoвныe минycы coбaк в квapтиpe cвязaны c eжeднeвнoй нeoбxoдимocтью yбиpaть зa ними шepcть и мycop.\
	\n И этo чиcтaя пpaвдa, пocкoлькy дaжe мaлo линяющee живoтнoe вce paвнo ocтaвляeт нa пoлy, мeбeли и oдeждe мaлeнькиe шepcтинки.\
	\n Eщe oдним минycoм мoжнo нaзвaть «нeyдoбныe» чepты xapaктepa живoтнoгo, нaпpимep, eгo пocтoянный лaй или cкyлeж.\
	\n Бeзycлoвнo, тaк вeдyт ceбя нe вce coбaки, oднaкo пpeдyгaдaть пoвeдeниe вaшeгo питoмцa cpaзy пpaктичecки нeвoзмoжнo.\
	\n Пpeждe чeм oкoнчaтeльнo peшить, cтoит ли зaвoдить coбaкy, пoтeнциaльным влaдeльцaм cлeдyeт oпpeдeлитьcя: гoтoвы ли oни пoжepтвoвaть пopядкoм в дoмe paди живoтнoгo и тpaтить нeмaлo дeнeг нa eгo coдepжaниe.\
	\n He cтoит зaбывaть, чтo пpaвильнo вocпитaннaя coбaкa пoмoжeт peбeнкy пoбopoть зacтeнчивocть и cтaнeт для нeгo дpyгoм, a для взpocлыx бyдeт иcтoчникoм paдocти и пoлoжитeльныx эмoций.')
elif a == 'Собака':
	print('\
	\nБoльшинcтвo людeй yвepeны, чтo ocнoвныe минycы coбaк в квapтиpe cвязaны c eжeднeвнoй нeoбxoдимocтью yбиpaть зa ними шepcть и мycop.\
	\n И этo чиcтaя пpaвдa, пocкoлькy дaжe мaлo линяющee живoтнoe вce paвнo ocтaвляeт нa пoлy, мeбeли и oдeждe мaлeнькиe шepcтинки.\
	\n Eщe oдним минycoм мoжнo нaзвaть «нeyдoбныe» чepты xapaктepa живoтнoгo, нaпpимep, eгo пocтoянный лaй или cкyлeж.\
	\n Бeзycлoвнo, тaк вeдyт ceбя нe вce coбaки, oднaкo пpeдyгaдaть пoвeдeниe вaшeгo питoмцa cpaзy пpaктичecки нeвoзмoжнo.\
	\n Пpeждe чeм oкoнчaтeльнo peшить, cтoит ли зaвoдить coбaкy, пoтeнциaльным влaдeльцaм cлeдyeт oпpeдeлитьcя: гoтoвы ли oни пoжepтвoвaть пopядкoм в дoмe paди живoтнoгo и тpaтить нeмaлo дeнeг нa eгo coдepжaниe.\
	\n He cтoит зaбывaть, чтo пpaвильнo вocпитaннaя coбaкa пoмoжeт peбeнкy пoбopoть зacтeнчивocть и cтaнeт для нeгo дpyгoм, a для взpocлыx бyдeт иcтoчникoм paдocти и пoлoжитeльныx эмoций.')
elif a == 'попугай':
	print('\
	\nПозитивные моменты в приобретении попугая\
	\nКрасота попугаев. Это самый простой и естественный плюс. Вариации их разновидностей, цветовой гаммы, яркости, не оставит равнодушным даже не очень больших любителей этих птиц.\
	\nУлучшение психологического состояния человека. Учеными мирового уровня доказано, что они способны помогать людям бороться с депрессиями, с легкостью подымают настроение.\
	\n Одиноким людям дают возможность не чувствовать себя растерянными, забытыми, позволяют ощущать себя в единении с природой. С ними можно поговорить, и даже научить выговаривать некоторые фразы.\
	\n Это своего рода антидепрессант, существуют даже специальные методики с использование попугаев для улучшения состояния душевного равновесия.\
	\nЛечат сердечно-сосудистую систему.\
	\nСпособность уничтожать негативную энергетику. В этом случае нужно доверится мнению экстрасенсов, которые утверждают имение этого свойства.\
	\n Развивают творческие умения, если таковы присутствуют.\
	\nПриносят море радости. Позитивно попугаи влияют и на взрослых, но следует отметить, что особую пользу они приносят в дом, где есть дети.\
	\n Благодаря этим птицам детки учатся познавать мир, даже и те детки, которые не разговаривают (в раннем возрасте) могут учить говорить своего любимца выговаривать слова, таким образом сами научатся быстрее говорить. Также попугаи приучают ухаживать за кем то еще, кроме себя, таким образом это организовывает к ответственности.\
	\nОт клетки с попугаем практически нет никакого неприятного запаха.\
	\nОстрый ум. Казалось бы, что попугаи мало что понимают, но прожив с ним некоторое время, станет ясно, что он не просто слушает, а и понимает то, о чем вы говорите, подпевает в ритм вашему разговору, говорят.\
	\nПри условиях хорошего ухода долго живут (10-15 лет). Что тоже не мало важно, ведь тяжело терять любимого питомца.\
	\nСравнительно не дорого обходятся в содержании. Все что нужно — это специальный корм для попугаев, к тому же, на протяжении дня, потребуется одна, максимум — две чайных ложки, вода, песок.\
	\n А если вы хотите добавить в рацион витаминов, можно давать зелень, перетертую яичную скорлупу. Согласитесь, все упомянутое выше, не может стоять дорого.')
elif a == 'Попугай':
	print('\
	\nПозитивные моменты в приобретении попугая\
	\nКрасота попугаев. Это самый простой и естественный плюс. Вариации их разновидностей, цветовой гаммы, яркости, не оставит равнодушным даже не очень больших любителей этих птиц.\
	\nУлучшение психологического состояния человека. Учеными мирового уровня доказано, что они способны помогать людям бороться с депрессиями, с легкостью подымают настроение.\
	\n Одиноким людям дают возможность не чувствовать себя растерянными, забытыми, позволяют ощущать себя в единении с природой. С ними можно поговорить, и даже научить выговаривать некоторые фразы.\
	\n Это своего рода антидепрессант, существуют даже специальные методики с использование попугаев для улучшения состояния душевного равновесия.\
	\nЛечат сердечно-сосудистую систему.\
	\nСпособность уничтожать негативную энергетику. В этом случае нужно доверится мнению экстрасенсов, которые утверждают имение этого свойства.\
	\n Развивают творческие умения, если таковы присутствуют.\
	\nПриносят море радости. Позитивно попугаи влияют и на взрослых, но следует отметить, что особую пользу они приносят в дом, где есть дети.\
	\n Благодаря этим птицам детки учатся познавать мир, даже и те детки, которые не разговаривают (в раннем возрасте) могут учить говорить своего любимца выговаривать слова, таким образом сами научатся быстрее говорить. Также попугаи приучают ухаживать за кем то еще, кроме себя, таким образом это организовывает к ответственности.\
	\nОт клетки с попугаем практически нет никакого неприятного запаха.\
	\nОстрый ум. Казалось бы, что попугаи мало что понимают, но прожив с ним некоторое время, станет ясно, что он не просто слушает, а и понимает то, о чем вы говорите, подпевает в ритм вашему разговору, говорят.\
	\nПри условиях хорошего ухода долго живут (10-15 лет). Что тоже не мало важно, ведь тяжело терять любимого питомца.\
	\nСравнительно не дорого обходятся в содержании. Все что нужно — это специальный корм для попугаев, к тому же, на протяжении дня, потребуется одна, максимум — две чайных ложки, вода, песок.\
	\n А если вы хотите добавить в рацион витаминов, можно давать зелень, перетертую яичную скорлупу. Согласитесь, все упомянутое выше, не может стоять дорого.')
elif a == 'черепаха':
	print('\
	\nПлюсы животного\
	\nМогут завести люди с непредсказуемым режимом. Питомцы не слишком требовательны в уходе, за ними нет необходимости постоянно присматривать\
	\nЛегко создать условия, близкие к природным. Черепаха уютно себя чувствует на приспособленной территории.\
	\nРептилию легко взять с собой в дальнюю поездку (в поезде, на машине). Для этого используется специальная переноска или обычная коробка. Кроме того, животное можно отдать на время знакомым (оно не требует пристального присмотра).\
	\nНевысокая стоимость корма.\
	\nПитомцы съедают до конца еду (высокая чистота съедания).\
	\nЖивотное нельзя назвать агрессивным.\
	\nМорские виды имеют яркую окраску, отличаются высокой активностью.\
	\nЛегкость приобретения, имеются во многих зоомагазинах.\
	\nВодные черепахи ухаживают друг за другом.\
	\nНе вызывает аллергических реакций (особенно актуально для семей, в которых есть маленькие дети).\
	\nНе требуется уличный выгул (одно из самых главных преимуществ).\
	\nЧастота кормления взросло особи — 2-3 раза в неделю (это весьма удобно для хозяев).\
	\nПитомец способен жить в одиночестве, ему не нужно приобретать дополнительно друга.\
	\nНе наносит ущерба мебели в доме или квартире.')
elif a == 'Черепаха':
	print('\
	\nПлюсы животного\
	Могут завести люди с непредсказуемым режимом. Питомцы не слишком требовательны в уходе, за ними нет необходимости постоянно присматривать\
	\nЛегко создать условия, близкие к природным. Черепаха уютно себя чувствует на приспособленной территории.\
	\nРептилию легко взять с собой в дальнюю поездку (в поезде, на машине). Для этого используется специальная переноска или обычная коробка. Кроме того, животное можно отдать на время знакомым (оно не требует пристального присмотра).\
	\nНевысокая стоимость корма.\
	\nПитомцы съедают до конца еду (высокая чистота съедания).\
	\nЖивотное нельзя назвать агрессивным.\
	\nМорские виды имеют яркую окраску, отличаются высокой активностью.\
	\nЛегкость приобретения, имеются во многих зоомагазинах.\
	\nВодные черепахи ухаживают друг за другом.\
	\nНе вызывает аллергических реакций (особенно актуально для семей, в которых есть маленькие дети).\
	\nНе требуется уличный выгул (одно из самых главных преимуществ).\
	\nЧастота кормления взросло особи — 2-3 раза в неделю (это весьма удобно для хозяев).\
	\nПитомец способен жить в одиночестве, ему не нужно приобретать дополнительно друга.\
	\nНе наносит ущерба мебели в доме или квартире.')
elif a == 'крыса':
	print('\
	\nПоложительные стороны\
	\nИмеет дружелюбный характер, с взаимной любовью относится к хозяевам, большинство зверей всегда готовы к общению.\
	\nЛегко поддается дрессировке, очень дисциплинирован, имеет высокий интеллект, по сравнению с другими грызунами.\
	\nЛюбит играть, постоянно активничает, интересно наблюдать за зверем вне клетки.\
	\nНе кусается и не царапается, если относится к нему доброжелательно.\
	\nНе привередлив в питании.\
	\nЗа ним легко ухаживать, и уборка в клетке не отнимает много сил и времени.\
	\nОбладает хорошим иммунитетом, редко заболевает (если следить за чистотой и состоянием здоровья животного).\
	\nНе производит много шума, не издает громких звуков, как кошки или собаки, не доставляет неудобств соседям.\
	\nНе наносит большого ущерба в доме.\
	\nНе требует уличных прогулок.\
	\nПо природе, крыса может прожить без полового партнера всю жизнь.\
	\nНа уход и питание не тратится много денег, как на дорогие породы собак и кошек.\
	\nПодходит для квартиры любой площади, клетка не занимает много места в доме.')
elif a == 'Крыса':
	print('\
	\nПоложительные стороны\
	\nИмеет дружелюбный характер, с взаимной любовью относится к хозяевам, большинство зверей всегда готовы к общению.\
	\nЛегко поддается дрессировке, очень дисциплинирован, имеет высокий интеллект, по сравнению с другими грызунами.\
	\nЛюбит играть, постоянно активничает, интересно наблюдать за зверем вне клетки.\
	\nНе кусается и не царапается, если относится к нему доброжелательно.\
	\nНе привередлив в питании.\
	\nЗа ним легко ухаживать, и уборка в клетке не отнимает много сил и времени.\
	\nОбладает хорошим иммунитетом, редко заболевает (если следить за чистотой и состоянием здоровья животного).\
	\nНе производит много шума, не издает громких звуков, как кошки или собаки, не доставляет неудобств соседям.\
	\nНе наносит большого ущерба в доме.\
	\nНе требует уличных прогулок.\
	\nПо природе, крыса может прожить без полового партнера всю жизнь.\
	\nНа уход и питание не тратится много денег, как на дорогие породы собак и кошек.\
	\nПодходит для квартиры любой площади, клетка не занимает много места в доме.')

questions=int(input('если у вас появился вопрос при выборе домашнего любимца то вы обратились по адресу. Ввдеите 1 если затрудняетесь какого питомца выбрать; 2 если затрудняятесь в выборе клички своему питомцу; 3 если хотите поддержать бездомных животных 4 если незнаете чем кормить животных '))
if questions == 1:
	print('\
	\nВы хотите завести домашнее животное, но не знаете, на что обращать внимание во время выбора?\
	\nДомашний питомец может стать для вас ответственностью на всю жизнь, так что будьте осторожны, принимая решение о том, с кем ее разделить.\
	\nДомашние животные – живые существа, не чучела, от них нельзя так просто отказаться, если вы "устали"\
	\nВыбор подходящего вам любимца может быть сложной задачей. Подумайте о том, каких животных вы любите.\
	\nВам нравятся маленькие и простые в уходе? Или вы предпочитаете крупных животных?\
	\nКогда вы думаете о размерах, помните о том, до каких размеров могут вырастать кошки и собаки, большие коты могут оставаться подходящих размеров, но некоторые из них вырастают больше.\
	\nЭто зависит от породы кошки или собаки.Если вы задумываетесь о покупке экзотического животного, проверьте свои муниципальные, провинциальные, государственные или федеральные законы про импортирование и владение таким животным.\
	\nЕсли вы импортируете животное из-за пределов страны, согласуйте это с авиакомпаниями, таможнями или администрацией портов, подготовьте все необходимые документы и обеспечьте карантинные процедуры для животных, поступающих из страны импортера.\
	\nЭти пункты могут измениться на границах без предупреждения в любой момент, в зависимости от санитарных норм.\
	\nНе стоит запугивать себя вышеперечисленными пунктами. Домашний питомец может стать любимым дополнением к вашей жизни, и вся работа и ответственность стоят этого. Но все же вы должны быть готовы к большой ответственности.\
	\nУзнайте больше о животном перед покупкой. Не поддавайтесь «импульсу» покупателя!\
	\nПомните, что подобрав животное на улице, вы спасаете жизнь кошки или собаки, поэтому это отличный способ для того, чтобы завести питомца. Кроме того, большинство приютов проводят обязательные операции по кастрации или вживлению чипов в ваше домашнее животное.\
	\nВ некоторых областях это даже закон, при взятии животного с улицы. Это спасает от перенаселенности, особенно у котов.\
	\nИспользуйте средства по уходу за животными, купленные в зоомагазинах. Некоторые магазины с плохой репутацией, получают щенков и котят от заводчиков.\
	\nЭто может допускать возможность наличия у животных генетических отклонений, которые могут вызвать проблемы с поведением или характером. В таком случае потребуется вмешательство ветеринара.\
	\nВаши родители категорически против? Попробуйте выгул собак, уход за щенками или работу волонтера в приюте для животных, чтобы показать родителям, насколько вы хотите быть связанными с животными\
	\nСкажите своим родителям, что вы самостоятельно купите все необходимое для животного, используя деньги, заработанные на выгуле и уходе за животными.\
	\nВсегда узнавайте о животном всю необходимую информацию перед покупкой. Это поможет вам лучше о нем заботиться и знать его потребности.\
	\nИщите свое идеального питомца в приютах для животных.\
	\nЕсли вы не можете выбрать между двумя видами домашних животных, спросите совета у своих родителей. Узнайте, кого бы они выбрали.')
elif questions == 2:
	print('\
	\nПравила выбора клички\
	\nПодобрать кличку можно, только соблюдая определённые правила. Так, каждое имя состоит из двух частей: собственно кличка и указание на заводчика или питомник, в котором щенок появился на свет (приставка).\
	\nПриставка может содержать предлог (тогда она располагается только после клички) или быть без него (в этом случае она может быть как до клички, так и после). Обычно у каждого питомника написания приставок (с предлогом или без, до клички или после) единообразны для всех щенков.\
	\nНа что обращать внимание при выборе клички для вашего щенка?\
	\nПосмотрите на цвет шерсти питомца. Существует огромное количество окрасов, которые могут подсказать вам оригинальную кличку. Шерсть вашего щенка может быть однотонной, двухцветной или комбинированной, с различными оттенками и подпалинами.\
	\nПитомец может быть пятнистым — помните Белого Бима Черное Ухо или мультфильм про далматинцев.\
	\nЧтобы ваш щенок как можно быстрее привык к своему новому имени, нужно как можно раньше начать процесс дрессировки.\
	\nЗовите щенка по имени так часто, как это возможно — первое время малыш не всегда будет откликаться, но через два-три дня уже привыкнет к имени.\
	\nОбязательно награждайте щенка поглаживанием или кусочком специального корма. Положительное закрепление пойдет на пользу, и питомец быстро запомнит свое имя.')
elif questions == 3:
	print('\
	\nПостоянный персонал большинства приютов состоит из владельца организации и двух-трех помощников. Этого мало, чтобы обеспечить животным полноценный уход. Поэтому многие организации привлекают волонтеров. Расскажем, какая помощь требуется чаще всего.\
	\nПеревозка. Иногда нужно перевезти животное, например, в ветеринарную клинику. Или забрать с пункта собранные вещи и привезти их в приют. А если ваш путь проходит мимо приюта, вы можете подвезти волонтеров на работу — до многих приютов сложно добраться без машины.\
	\n Если у вас есть машина и свободный день — предложите свою помощь. Скорее всего, ваши услуги понадобятся.\
	\nУборка вольеров и территории. Особенно волонтеры нужны весной и осенью, когда на улице грязно.\
	\nВыгул собак. Сотрудники большинства приютов не успевают гулять со всеми собаками: многие животные неделями сидят взаперти. Волонтеры могут время от времени приезжать и выгуливать животных.\
	\nСоциализация и общение. Большинство животных попадают в приют с улицы, поэтому не умеют общаться с людьми или боятся их — нападают, прячутся.\
	\n Такое поведение снижает шансы найти им дом. Волонтеры могут научить общению и нужным привычкам, например, приучить собаку гулять на поводке, а кошку — к тактильному контакту.')
elif questions == 4:	
	print('\
	\nНикогда не давайте питомцу горячую или очень холодную пищу. Она должна быть комнатной температуры. Жареное, сладкое, жирное, маринованное, перченое для животного вредно.\
	\nНе кормите питомца остатками со стола, не давайте ему вкусняшек, которые едите сами. Они могут не только спровоцировать отравление, но и стать причиной летального исхода.\
	\n Если хотите, чтобы питомец долго жил и был здоровым, его надо правильно кормить. С пищей он должен получать все вещества, необходимые для роста и развития. Рацион обязан быть сбалансирован, вредная еда исключена.\
	\nПочему животных надо кормить правильно\
	\nС пищей питомцы получают полезные вещества, которые идут на построение клеток. Продукты по пищеводу попадают в желудок, где перевариваются с помощью кислотного сока. Дальше она идет в кишечник и проходит ряд трансформаций – углеводы превращаются в глюкозу, липиды в жирные кислоты, белки в аминокислоты и т. д.\
	\nПолученные элементы всасываются в кровь через стенки кишечника, тогда как непереработанная пища покидает организм с фекалиями. Глюкоза, жиры, аминокислоты, другие вещества в составе крови поступают к клеткам, которые используют их для роста и развития.\
	\nСоответственно, от того насколько качественным будет продукт, зависит здоровье питомца. Из гнилой пищи можно извлечь лишь вредные компоненты. Они токсичны, поэтому яд разнесется по организму, пропитает каждую клетку и может ее разрушить. Результат – проблемы с сердцем, печенью, почками, слабый иммунитет.\
	\nОсновные правила кормления\
	\nЧтобы питомец был здоров, надо не только следить за качеством, но и количеством продуктов. Не перекармливайте – ожирение ему ни к чему. Взрослого любимца надо кормить 2 раза в день, щенков и котят соответственно возрасту:\
	\n2 мес. – 6 раз через 3,5 ч.;\
	\n3-4 мес. – 5 раз через 4 ч.;\
	\n4-6 мес. – 4 раза через 4-5 ч.;\
	\nпосле 6 мес. – 3 раза с интервалом в 6 ч.;\
	\nпосле 10 мес. – 2 раза в день.')
else:
	print('мяу... мы не поняли какой вопрос вы задали')